alpha_1.45/0/TauDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor>
24767
(
( 7.50534781e-08 3.608278121e-08 3.555794992e-09 1.738924205e-08 1.698419849e-09 2.852417822e-07 )
( 3.026127615e-07 1.434733292e-07 1.404522276e-08 6.835913524e-08 6.695309196e-09 1.100815666e-06 )
( 7.478860198e-08 3.49854794e-08 3.358979983e-09 1.639626035e-08 1.567247998e-09 2.788412417e-07 )
( 8.575406696e-07 3.989805464e-07 3.809129723e-08 1.876706932e-07 1.808052197e-08 2.964078703e-06 )
( 3.01668905e-07 1.40308174e-07 1.342133782e-08 6.555735155e-08 6.294554211e-09 1.081000846e-06 )
( 7.992866102e-08 3.715494756e-08 3.452327313e-09 1.7303325e-08 1.598625343e-09 2.886587254e-07 )
( 1.821072942e-06 8.277897905e-07 7.474519492e-08 3.846327843e-07 3.546644223e-08 5.950993454e-06 )
( 8.54914731e-07 3.923039458e-07 3.683775773e-08 1.819286126e-07 1.725277166e-08 2.914990318e-06 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
}


// ************************************************************************* //
