alpha_1.45/0/UDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
24767
(
( 0.0006454149843 0.0003134131548 -7.293080671e-06 )
( 0.001381580369 0.0006678196369 -1.586244252e-05 )
( 0.0006377819227 0.0003015022376 -7.326026207e-06 )
( 0.00244563818 0.001174348872 -2.878247506e-05 )
( 0.001366282348 0.0006466842024 -1.581200922e-05 )
( 0.0006492298562 0.0003040943411 -7.381931027e-06 )
( 0.003634606721 0.00173274742 -4.436340532e-05 )
( 0.002419712022 0.001142985187 -2.850941382e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
